pandas数据结构介绍，Series和DataFrame
Series包含一个值序列并且包含了数据标签
#values属性和index属性
#用index属性来修改标签
#通过index来查找数据
#除此之外还有简单的布尔操作
#字典可以直接转化为Series数据
#用 isnull 和notnull来检查数据缺省

In [1]:
import pandas as pd
obj=pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [2]:
#values属性和index属性
obj.index

RangeIndex(start=0, stop=4, step=1)

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
#用index属性来修改标签
obj=pd.Series([i for i in range(4)],index=['q','w','e','r'])
obj

q    0
w    1
e    2
r    3
dtype: int64

In [5]:
#通过index来查找数据
obj[obj>0]

w    1
e    2
r    3
dtype: int64

In [6]:
obj*2

q    0
w    2
e    4
r    6
dtype: int64

In [ ]:
从另一个角度理解Series是一个长度固定而且有序的字典

In [7]:
#除此之外还有简单的布尔操作
'b' in obj

False

In [9]:
#字典可以直接转化为Series数据
mydict={'name':'lee','age':'13','weight':'45'}
obj=pd.Series(mydict)
obj

age        13
name      lee
weight     45
dtype: object

In [ ]:
#用 isnull 和notnull来检查数据缺省

DataFrame表示的是矩阵的数据表，既有行索引又有列索引
#对于比较大的数据 head（）方法会打印前五行数据
#如果指定了序列，那么DataFrame的列就会按照指定顺序排列
index 和columns
#通过类似字典标记的方式或属性的方式，可以将 DataFrame 的列获取为一个Series：
#行也可以通过位置或名称的方式进行获取，比如用 loc 属性
'''将列表或数组赋值给某个列时，其长度必须跟 DataFrame 的长度相匹配。
   如果赋值的是一个 Series，就会精确匹配 DataFrame 的索引，所有的空
   位都将被填上缺失值：'''
#del frame['name'] 删除列
'''注意：通过索引方式返回的列只是相应数据的视图而已，并不是副本。
因此，对返回的 Series 所做的任何就地修改全都会反映到源 DataFrame
上。通过 Series 的 copy 方法即可指定复制列。'''
'''如果嵌套字典传给 DataFrame，pandas 就会被解释为：外层字典的键作为列，
内层键则作为行索引：'''
'''你也可以使用类似 NumPy 数组的方法，.T 对 DataFrame 进行转置（交换行和列）：'''

In [10]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],

        'year': [2000, 2001, 2002, 2001, 2002, 2003],

        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]} 
frame=pd.DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [13]:
#对于比较大的数据 head（）方法会打印前五行数据
frame.head()

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [18]:
#如果指定了序列，那么DataFrame的列就会按照指定顺序排列
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],

        'year': [2000, 2001, 2002, 2001, 2002, 2003],

        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]} 
pd.DataFrame(data,columns=['year','state',"Pop"])

   year   state  Pop
0  2000    Ohio  NaN
1  2001    Ohio  NaN
2  2002    Ohio  NaN
3  2001  Nevada  NaN
4  2002  Nevada  NaN
5  2003  Nevada  NaN

In [20]:
#index
frame=pd.DataFrame(data,columns=['year','state',"pop",'debet'],
                   index=['one', 'two', 'three', 'four','five', 'six'])

frame

       year   state  pop debet
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7   NaN
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9   NaN
six    2003  Nevada  3.2   NaN

In [22]:
#通过类似字典标记的方式或属性的方式，可以将 DataFrame 的列获取为一个Series：
frame['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [23]:
#行也可以通过位置或名称的方式进行获取，比如用 loc 属性
frame.loc['three']

year     2002
state    Ohio
pop       3.6
debet     NaN
Name: three, dtype: object

In [25]:
'''将列表或数组赋值给某个列时，其长度必须跟 DataFrame 的长度相匹配。
   如果赋值的是一个 Series，就会精确匹配 DataFrame 的索引，所有的空
   位都将被填上缺失值：'''
val=pd.Series([-1.2,-1.5,-1.7],index=['two', 'four', 'five'])
frame['debet']=val
frame

       year   state  pop  debet
one    2000    Ohio  1.5    NaN
two    2001    Ohio  1.7   -1.2
three  2002    Ohio  3.6    NaN
four   2001  Nevada  2.4   -1.5
five   2002  Nevada  2.9   -1.7
six    2003  Nevada  3.2    NaN

In [30]:
#del 删除列
frame['eastern']=frame.state=='Ohio'#增加一个布尔列
frame

       year   state  pop  debet  eastern
one    2000    Ohio  1.5    NaN     True
two    2001    Ohio  1.7   -1.2     True
three  2002    Ohio  3.6    NaN     True
four   2001  Nevada  2.4   -1.5    False
five   2002  Nevada  2.9   -1.7    False
six    2003  Nevada  3.2    NaN    False

In [31]:
del frame['eastern']
frame

       year   state  pop  debet
one    2000    Ohio  1.5    NaN
two    2001    Ohio  1.7   -1.2
three  2002    Ohio  3.6    NaN
four   2001  Nevada  2.4   -1.5
five   2002  Nevada  2.9   -1.7
six    2003  Nevada  3.2    NaN

In [ ]:
'''注意：通过索引方式返回的列只是相应数据的视图而已，并不是副本。
因此，对返回的 Series 所做的任何就地修改全都会反映到源 DataFrame
上。通过 Series 的 copy 方法即可指定复制列。'''

In [32]:
'''如果嵌套字典传给 DataFrame，pandas 就会被解释为：外层字典的键作为列，
内层键则作为行索引：'''
pop = {'Nevada': {2001: 2.4, 2002: 2.9},

        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame=pd.DataFrame(pop)
frame

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [33]:
'''你也可以使用类似 NumPy 数组的方法，对 DataFrame 进行转置（交换行和列）：'''
frame.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [35]:
#索引对象
obj=pd.Series(range(3),index=['a','b','c'])
myindex=obj.index
myindex

Index(['a', 'b', 'c'], dtype='object')

In [36]:
#Index 对象是不可变的，因此用户不能对其进行修改：
myindex[1]='d'

TypeError: Index does not support mutable operations

In [ ]:
#与 python 的集合不同，pandas 的 Index 可以包含重复的标签：

In [37]:
#reindex
#用该 Series 的 reindex 将会根据新索引进行重排。如果某个索引值当前不存在，就引入缺失值：
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [39]:
obj2=obj.reindex(['a','b','c','d'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [41]:
obj3=pd.Series(['blue','purple','yellow'],index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [43]:
#对于时间序列这样的有序数据，重新索引时可能需要做一些插值处理。
#method选项即可达到此目的，例如，使用 ffill 可以实现前向值填充
obj3=pd.Series(['blue','purple','yellow'],index=[0,2,4])
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [45]:
import numpy as np
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                    index=['a', 'c', 'd'],
                    columns=['Ohio', 'Texas','California'])	
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [46]:
#借助 DataFrame，reindex 可以修改（行）索引和列。只传递一个序列时，会重新索引结果的行：


frame2=frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [49]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [50]:
#丢弃指定轴上项
#drop 方法返回的是一个在指定轴上删除了指定值的新对象：
obj=pd.Series(np.arange(5.),index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [51]:
new_obj=obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [52]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'NewYork'],
                    columns=['one', 'two', 'three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [53]:
#用标签序列调用 drop 会从行标签（axis 0）删除值：
#通过传递 axis=1 或 axis='columns'可以删除列的值：
data.drop('Ohio')

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [55]:
data.drop('one',axis='columns')

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
NewYork    13     14    15

In [66]:
obj=pd.Series(np.arange(5.),index=['a','b','c','d','e'])

obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [70]:
obj=pd.Series(np.arange(4.),index=['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [71]:
obj['a']

0.0

In [73]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [74]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                     index=['Ohio', 'Colorado', 'Utah', 'New York'],
                     columns=['one', 'two', 'three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [75]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [76]:
data[:2]  #切片行

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [77]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [78]:
#另一种用法是通过布尔型 DataFrame（比如下面这个由标量比较运算得出的）进行索引：
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [81]:
data[data<5]=0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [83]:
#loc是名字索引
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [84]:
#iloc 是位置索引
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [85]:
#整数索引
ser=pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [ ]:
ser[-1]

In [88]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [89]:
ser2[-1]

2.0

In [90]:
#算术运算和数据对齐
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'e', 'f', 'g'])

s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [91]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [93]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [94]:
#对于 DataFrame，对齐操作会同时发生在行和列上：
df1= pd.DataFrame(np.arange(9.).reshape((3, 3)),
                   columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2= pd.DataFrame(np.arange(12.).reshape((4, 3)),
                  columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas','Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [95]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [96]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [97]:
df1 = pd.DataFrame({'A': [1, 2]})

df2 = pd.DataFrame({'B': [3, 4]})

df1-df2

    A   B
0 NaN NaN
1 NaN NaN

In [100]:
df1= pd.DataFrame(np.arange(12.).reshape((3, 4)),
                columns=list('abcd'))
df2= pd.DataFrame(np.arange(20.).reshape((4, 5)),
                columns=list('abcde'))
df2.iloc[1,[1]]=np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [101]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [103]:
  
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [113]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                    columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas','Oregon'])
series = frame.iloc[0]

In [114]:
frame-series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [115]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [116]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [117]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [118]:
frame.sub(series, axis='index')

         b   d   e
Ohio   NaN NaN NaN
Oregon NaN NaN NaN
Texas  NaN NaN NaN
Utah   NaN NaN NaN
b      NaN NaN NaN
d      NaN NaN NaN
e      NaN NaN NaN

In [119]:
frame = pd.DataFrame(np.random.randn(4, 3),
                    columns=list('bde'),	
                    index=['Utah', 'Ohio', 'Texas','Oregon'])
frame

               b         d         e
Utah    0.575723 -1.360788  0.522813
Ohio    0.965487 -1.149311  1.736356
Texas   1.230791  0.545223 -0.296615
Oregon  1.379751  0.177165  1.340349

In [120]:
np.abs(frame)

               b         d         e
Utah    0.575723  1.360788  0.522813
Ohio    0.965487  1.149311  1.736356
Texas   1.230791  0.545223  0.296615
Oregon  1.379751  0.177165  1.340349

In [121]:
f=lambda x:x.max()-x.min()
frame.apply(f)

b    0.804028
d    1.906011
e    2.032971
dtype: float64

In [122]:
frame.apply(f,axis='columns')

Utah      1.936511
Ohio      2.885667
Texas     1.527405
Oregon    1.202586
dtype: float64

In [123]:
format=lambda x:'%.2f'%x
frame.applymap(format)

           b      d      e
Utah    0.58  -1.36   0.52
Ohio    0.97  -1.15   1.74
Texas   1.23   0.55  -0.30
Oregon  1.38   0.18   1.34

In [124]:
obj=pd.Series(range(4),index=['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [125]:
frame= pd.DataFrame(np.arange(8).reshape((2, 4)),
                    index=['three', 'one'],
                    columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [126]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [128]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [130]:
obj=pd.Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [131]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [132]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [134]:
obj=pd.Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [136]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [137]:
a={1,2,1}
print(a)

{1, 2}

In [138]:
#重复索引轴
obj=pd.Series(range(5),index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [140]:
obj.index.is_unique

False

In [141]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],
                    index=['a', 'b', 'c', 'd'],
                    columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [142]:
#调用 DataFrame 的 sum 方法将会返回一个含有列的和的 Series：
df.sum()

one    9.25
two   -5.80
dtype: float64

In [143]:
#传入 axis='columns'或 axis=1 将会按行进行求和运算：
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [144]:
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [145]:
#有些方法（如 idxmin 和 idxmax）返回的是间接统计（比如达到最小值或最大值的索引）：
df.idxmax()

one    b
two    d
dtype: object

In [146]:
#另一些方法则是累计型的：df.cumsum() 
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [148]:
#还有一种方法，它既不是约简型也不是累计型。describe 就是一个例子，它用于一次性产生多个汇总统计：
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [149]:
#对于非数值型数据，describe 会产生另外一种汇总统计：
obj=pd.Series(['a','a','b','c']*4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [150]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [153]:
#相关系数与协方差
import pandas_datareader.data as web
all_data={ticker: web.get_data_yahoo(ticker)
         for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price=pd.DataFrame({ticker:data['Adj Close']
                  for ticker, data in all_data.items()})
price.head

<bound method NDFrame.head of                   AAPL         GOOG         IBM        MSFT
Date
2009-12-31   19.996618   307.986847   98.137283   24.152580
2010-01-04   20.307869   311.349976   99.299347   24.525019
2010-01-05   20.342979   309.978882   98.099792   24.532942
2010-01-06   20.019398   302.164703   97.462532   24.382378
2010-01-07   19.982389   295.130463   97.125160   24.128809
2010-01-08   20.115240   299.064880   98.099792   24.295214
2010-01-11   19.937790   298.612823   97.072685   23.986179
2010-01-12   19.710993   293.332153   97.844872   23.827694
2010-01-13   19.989031   291.648102   97.634964   24.049570
2010-01-14   19.873259   293.019196   99.194389   24.532942
2010-01-15   19.541140   288.126007   98.797028   24.453693
2010-01-19   20.405605   291.911407  100.566330   24.643881
2010-01-20   20.091518   288.329681   97.649979   24.239746
2010-01-21   19.744209   289.606384   96.712860   23.780155
2010-01-22   18.764919   273.227905   94.088844   22.948128
2010-01-25   19.269749   268.255249   94.553688   23.233395
2010-01-26   19.542088   269.457428   94.276276   23.376024
2010-01-27   19.726181   269.298462   94.711105   23.510740
2010-01-28   18.911057   265.418701   92.776848   23.106604
2010-01-29   18.224987   263.257751   91.757233   22.330048
2010-02-01   18.478348   264.787811   93.466576   22.512297
2010-02-02   18.585581   263.843964   94.111336   22.551926
2010-02-03   18.905357   268.662598   94.208817   22.686628
2010-02-04   18.224039   261.687958   92.214569   22.060629
2010-02-05   18.547623   263.928406   92.604401   22.203266
2010-02-08   18.420462   265.011353   91.783577   21.965540
2010-02-09   18.616892   266.486755   92.785126   22.195339
2010-02-10   18.515354   265.498199   92.483902   22.179491
2010-02-11   18.852224   266.466888   93.176750   22.282507
2010-02-12   19.014488   264.837494   93.380051   22.131947
...                ...          ...         ...         ...
2019-04-11  198.186783  1204.619995  142.092148  119.886230
2019-04-12  198.107086  1217.869995  142.655457  120.503937
2019-04-15  198.465714  1221.099976  142.210739  120.603577
2019-04-16  198.485641  1227.130005  143.436188  120.324600
2019-04-17  202.350754  1236.339966  137.476974  121.320915
2019-04-18  203.077957  1236.369995  138.682648  122.915016
2019-04-22  203.745377  1248.839966  137.259552  123.303581
2019-04-23  206.684052  1264.550049  138.791351  124.977379
2019-04-24  206.365295  1256.000000  138.307098  124.548965
2019-04-25  204.492508  1263.449951  137.002609  128.673691
2019-04-26  203.516266  1272.180054  137.803101  129.410965
2019-04-29  203.825073  1287.579956  137.417679  129.291412
2019-04-30  199.900192  1188.479980  138.623352  130.118362
2019-05-01  209.712402  1168.079956  138.909943  127.408379
2019-05-02  208.347656  1162.609985  137.951324  125.744537
2019-05-03  210.937683  1185.400024  138.603592  128.424606
2019-05-06  207.680222  1189.390015  138.732071  127.677376
2019-05-07  202.081787  1174.099976  136.024231  125.057083
2019-05-08  202.121628  1166.270020  136.380005  125.047127
2019-05-09  199.949997  1162.380005  135.339996  125.037155
2019-05-10  197.179993  1164.270020  135.320007  126.661148
2019-05-13  185.720001  1132.030029  131.419998  122.895088
2019-05-14  188.660004  1120.439941  133.309998  124.270004
2019-05-15  190.919998  1164.209961  134.399994  126.019997
2019-05-16  190.080002  1178.979980  135.880005  128.929993
2019-05-17  189.000000  1162.300049  134.320007  128.070007
2019-05-20  183.089996  1138.849976  135.119995  126.220001
2019-05-21  186.600006  1149.630005  136.449997  126.900002
2019-05-22  182.779999  1151.420044  136.350006  127.669998
2019-05-23  179.660004  1140.770020  132.389999  126.180000

[2364 rows x 4 columns]>

In [154]:
volume = pd.DataFrame({ticker: data['Volume']
                       for ticker, data in all_data.items()})

In [155]:
returns=price.pct_change()

In [156]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2019-05-17 -0.005682 -0.014148 -0.011481 -0.006670
2019-05-20 -0.031270 -0.020176  0.005956 -0.014445
2019-05-21  0.019171  0.009466  0.009843  0.005387
2019-05-22 -0.020472  0.001557 -0.000733  0.006068
2019-05-23 -0.017070 -0.009249 -0.029043 -0.011671

In [157]:
#Series 的 corr 方法用于计算两个 Series 中重叠的、非 NA 的、
#按索引对齐的值的相关系数。与此类似，cov 用于计算协方差：
returns['MSFT'].corr(returns['IBM'])

0.4872192592786094

In [159]:
returns['MSFT'].cov(returns['IBM'])

8.685735903137937e-05

In [160]:
'''另一方面，DataFrame 的 corr 和 cov 方法将以 DataFrame 的形式
分别返回完整的相关系数或协方差矩阵：'''
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.457235  0.373085  0.449937
GOOG  0.457235  1.000000  0.404334  0.535596
IBM   0.373085  0.404334  1.000000  0.487219
MSFT  0.449937  0.535596  0.487219  1.000000

In [161]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000271  0.000116  0.000076  0.000107
GOOG  0.000116  0.000239  0.000077  0.000120
IBM   0.000076  0.000077  0.000152  0.000087
MSFT  0.000107  0.000120  0.000087  0.000209

In [162]:
'''利用 DataFrame 的 corrwith 方法，你可以计算其列或行跟另一个 Series
或 DataFrame 之间的相关系数。传入一个 Series
将会返回一个相关系数值 Series （针对各列进行计算）：'''
returns.corrwith(returns.IBM)

AAPL    0.373085
GOOG    0.404334
IBM     1.000000
MSFT    0.487219
dtype: float64

In [163]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [164]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [165]:
#value_counts 用于计算一个 Series 中各值出现的频率：
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [166]:
pd.value_counts(obj.values,sort=False)

b    2
d    1
a    3
c    3
dtype: int64

In [168]:
mask=obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [170]:
to_match=pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals=pd.Series(['c','b','a'])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [171]:
#有时，你可能希望得到 DataFrame 中多个相关列的一张柱状图。
#将 pandas.value_counts 传给该 DataFrame 的 apply 函数，就会出现
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [172]:
#行后面的频率是前面行数数字在本列出现的次数
result=data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0